Revit 2027 API
ColorWithTransparency.SetColor Method
 set color
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetColor(
	Color color
)
Public Sub SetColor (
	color As Color
)
public:
void SetColor(
	Color^ color
)
member SetColor :
        color : Color -> unit
Parameters
color Color
 color
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ColorWithTransparency Class
Autodesk.Revit.DB Namespace